<template>
  <div>
    <ul>
      <li v-for="(li,index) in love" :key="index">{{li}}</li>
    </ul>
  </div>
</template>
<script>
export default {
  data() {
    return{
      //https://www.zhihu.com/question/54969512/answer/767298508
      love:[
        // '祝有人喝了酒 眼睛珊珊的跟你讲浪漫和爱',  //浪漫和爱
        // '越过喜马拉雅的山巅，愿世界化为沧海，愿你我归于初见', //于山于海
        // '爱而不得的时候，再爱就不礼貌啦', //请别再爱
        // '有运气相遇，只是这次不够幸运。',//幸运不够
        // '情不知所起，一往而深。', //情深一往
        // '晓看天色暮看云，行也思君，坐也思君',  //思君
        // '你走，我不送你，你来，无论多大风多大雨，我要去接你。', //我去接你
        // '答案很长，我得用一生去回答你，准备好听我讲了吗？', //请听我讲
        '爱上你这件事太美妙了，三缄其口，却又四海生风，有亏盈，有枯荣。',
        '眼睛为她下着雨，心却为她打着伞，这就是爱情',
        '月色和雪色之间，你是第三种绝色',
        '海底月是天上月，眼前人是心上人，向来心是看客心，奈何人是剧中人。',
        '世界上美好的东西不太多，立秋傍晚从河对岸吹来的风，和二十来岁笑起来要人命的你。',
        '朋友问我“有喜欢的人吗？” 本能的回答道“没有啦。” 但是脑海中却浮现出你的面容。 ——北川理惠 《三行情书》',
        '凌晨四点钟，我看见海棠花未眠，总觉得这时你应该在我身边',
        '愿你垂垂老矣，我可明我心',
        '其实我不太懂喜欢，可我想走向你',
        '冗长的黑夜里，你是我唯一的光',
        '你若喜欢田野，我愿植荒十年，换得一时春生',
        '雾起时，我就在你的怀里，雾散后，却是一生。——席慕蓉',
        '当我跨过沉沦的一切，向着永恒开战的时候，你是我的军旗。 ——王小波',
        '水来我在水中等你，火来我在灰烬中等你——洛夫',
        '你呼吸着阳光，我呼吸着月亮，可我们在同一的爱情中生长——阿赫玛托娃',
        '你所在之处，是我不得不思念的天涯海角。——简媜',
        '若我看倦了风景，走累了路。你是否，愿意变成酒色的石头，让我把余生靠一靠。——简媜'
      ]
    }
  }
}
</script>
<style lang="scss" scoped>

</style>