<template>
  <div>
    <ul>
      <li v-for="(li,index) in love" :key="index">{{li}}</li>
    </ul>
  </div>
</template>
<script>
export default {
  data() {
    return{
      //https://www.zhihu.com/question/54969512/answer/767298508
      love:[
        '爱上你这件事太美妙了，三缄其口，却又四海生风，有亏盈，有枯荣。',
        // '祝有人喝了酒 眼睛珊珊的跟你讲浪漫和爱',
        '眼睛为她下着雨，心却为她打着伞，这就是爱情',
        // '爱而不得的时候，再爱就不礼貌啦',
        '有运气相遇，只是这次不够幸运。',//幸运不够
        '月色和雪色之间，你是第三种绝色',
        '海底月是天上月，眼前人是心上人，向来心是看客心，奈何人是剧中人。',
        '晓看天色暮看云，行也思君，坐也思君。',
        // '情不知所起，一往而深。',
        '答案很长，我得用一生去回答你，准备好听我讲了吗？',
        '你走，我不送你，你来，无论多大风多大雨，我要去接你。',
        '世界上美好的东西不太多，立秋傍晚从河对岸吹来的风，和二十来岁笑起来要人命的你。',
        '朋友问我“有喜欢的人吗？” 本能的回答道“没有啦。” 但是脑海中却浮现出你的面容。 ——北川理惠 《三行情书》',
        '',
      ]
    }
  }
}
</script>
<style lang="scss" scoped>

</style>